identification division.
PROGRAM-ID. FILESTATUS.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT EMPLOYEEFILE ASSIGN TO ""
    FILE STATUS IS FILE-CHECK-KEY

PROCEDURE DIVISION.
0100-READ-EMPLOYEES.
OPEN INPUT EMPLOYEEFILEIF
IF FILE-CHECK-KEY NOT="00"
    DISPLAY " ", FILE-CHECK-KEY
    GO TO 9000-END-PROGRAM
END-IF.

