       IDENTIFICATION DIVISION.
       PROGRAM-ID. CH3CHALLENGE.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
               
       DATA DIVISION.
					   
       WORKING-STORAGE SECTION.

	   01  WS-FIELDS.
	       05  FILLER           PIC X(30) VALUE 
		      'WORKING STORAGE STARTS HERE'.
		   
		       
   
       PROCEDURE DIVISION.
       0100-START.
	   
	   0100-END.
	       
		
		   
       
       0300-STOP-RUN.
	     
           STOP RUN.
           
          END PROGRAM CH3CHALLENGE.
