       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUPPLIER.
      * CREATE A RELATIVE FILE FROM A SEQUENTIAL FILE
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

	   SELECT INPUTSUPPLIER ASSIGN TO "SUPPLIERSEQ.DAT"
	     ORGANIZATION IS LINE SEQUENTIAL.
       
	   SELECT SUPPLIERFILE ASSIGN TO "RELSUPPLIER.DAT"
        FILE STATUS IS FILE-CHECK-KEY
		ORGANIZATION IS RELATIVE
		ACCESS MODE IS RANDOM
		RELATIVE KEY IS SUPPLIER-KEY.

       DATA DIVISION.
       FILE SECTION.
	   FD SUPPLIERFILE.
	   01 SUPPLIERRECORD.
	      05 SUPPLIERCODE    PIC 99.
		  05 SUPPLIERNAME    PIC X(20).
		  05 SUPPLIERADDRESS PIC X(50).
	
       FD INPUTSUPPLIER.
	   01 SUPPLIERSEQRECORD.
	      88 ENDOFFILE       VALUE HIGH-VALUES.
		  05 SUPPLIERCODESEQ PIC 99.
		  05 SUPPLIERNAMESEQ PIC X(20).
		  05 SUPPLIERADDRSEQ PIC X(50).
	
		
       WORKING-STORAGE SECTION.
       01  WS-WORKING-STORAGE.
           05 FILLER      PIC X(27) VALUE 
		      'WORKING STORAGE STARTS HERE'.
     
   
	   01  WS-WORK-AREAS.
	       05  FILE-CHECK-KEY   PIC X(2).
		   05  SUPPLIER-KEY     PIC 99.
		 

       PROCEDURE DIVISION.
       0100-READ-SUPPLIERS.

		   OPEN INPUT INPUTSUPPLIER.
		   OPEN OUTPUT SUPPLIERFILE.
		   				
           READ INPUTSUPPLIER 
		     AT END SET ENDOFFILE TO TRUE
		   END-READ.
		   PERFORM 0200-PROCESS-FILE UNTIL
		      ENDOFFILE.
		 
		   PERFORM 9000-END-PROGRAM.
		   
	   0100-END.
	   
	   0200-PROCESS-FILE.
	       MOVE SUPPLIERCODESEQ TO 
		      SUPPLIER-KEY.
		   MOVE SUPPLIERSEQRECORD TO 
		      SUPPLIERRECORD.
		   WRITE SUPPLIERRECORD
		      INVALID KEY DISPLAY 
			     "SUPPLIER STATUS = " FILE-CHECK-KEY
		   END-WRITE.
		   READ INPUTSUPPLIER
		      AT END SET ENDOFFILE TO TRUE.
		0200-END.
		   
	   9000-END-PROGRAM.
           CLOSE SUPPLIERFILE, INPUTSUPPLIER. 
      	   
		 
                
           STOP RUN.
           
          END PROGRAM SUPPLIER.
