       IDENTIFICATION DIVISION.
       PROGRAM-ID. READSUPPLIER.
      * READS A RELATIVE FILE FROM A SEQUENTIAL FILE
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   
	   SELECT INPUTSUPPLIER ASSIGN TO "RELSUPPLIER.DAT"
        FILE STATUS IS FILE-CHECK-KEY
		ORGANIZATION IS RELATIVE
		ACCESS MODE IS RANDOM
		RELATIVE KEY IS SUPPLIER-KEY.
    
       DATA DIVISION.
       FILE SECTION.
	   FD INPUTSUPPLIER.
	   01 SUPPLIERRECORD.
	      88 ENDOFFILE             VALUE HIGH-VALUES.
	      05 SUPPLIERCODE          PIC 99.
		  05 SUPPLIERNAME          PIC X(20).
		  05 SUPPLIERADDRESS       PIC X(50).
		
       WORKING-STORAGE SECTION.
       01  WS-WORKING-STORAGE.
           05 FILLER               PIC X(27) VALUE 
		      'WORKING STORAGE STARTS HERE'.
     
   
	   01  WS-WORK-AREAS.
	       05  FILE-CHECK-KEY      PIC X(2).
		       88 RECORDFOUND      VALUE "00".
			   
		   05  SUPPLIER-KEY        PIC 99.
		   
	       05  PRINTRECORD.
               10  PRTSUPPLIERCODE PIC BB99.
               10  PRTSUPPLIERNAME PIC BBX(20).
               10  PRTSUPPLIERADDR PIC BBX(50).

           05  READTYPE            PIC 9.
               88 DIRECTREAD       VALUE 1.
               88 SEQUENTIALREAD   VALUE 2.			   
		 

       PROCEDURE DIVISION.
       0100-START.

		   OPEN INPUT INPUTSUPPLIER.
		   DISPLAY "READ TYPE: DIRECT READ ENTER 1". 
		   DISPLAY "READ TYPE: SEQUENTIAL READ ENTER 2".
			  
		   ACCEPT READTYPE.
		   
		   IF DIRECTREAD 
		      DISPLAY "ENTER SUPPLIER CODE KEY: "
			    
			  ACCEPT SUPPLIER-KEY
			  READ INPUTSUPPLIER
			    INVALID KEY DISPLAY "SUPPLIER STATUS: ",
				  FILE-CHECK-KEY
			  END-READ
			  PERFORM 0200-DISPLAY-RECORD
           END-IF.	

           IF SEQUENTIALREAD 
              READ INPUTSUPPLIER NEXT RECORD
                AT END SET ENDOFFILE TO TRUE
              END-READ
              PERFORM UNTIL ENDOFFILE   
                 PERFORM 0200-DISPLAY-RECORD
                 READ INPUTSUPPLIER NEXT RECORD 
                   AT END SET ENDOFFILE TO TRUE 
                 END-READ
			  END-PERFORM
			END-IF
			
			CLOSE INPUTSUPPLIER.
			STOP RUN.
				 
		   				
           READ INPUTSUPPLIER 
		     AT END SET ENDOFFILE TO TRUE
		   END-READ.
		   PERFORM 0200-DISPLAY-RECORD UNTIL
		      ENDOFFILE.
		 
		   PERFORM 9000-END-PROGRAM.
		   
	   0100-END.
	   
	   0200-DISPLAY-RECORD.
	       IF RECORDFOUND
		      MOVE SUPPLIERCODE TO PRTSUPPLIERCODE
			  MOVE SUPPLIERNAME TO PRTSUPPLIERNAME
			  MOVE SUPPLIERADDRESS TO PRTSUPPLIERADDR
			  DISPLAY PRINTRECORD
		   END-IF.
	   0200-END.
		   
	   9000-END-PROGRAM.
           CLOSE INPUTSUPPLIER.    	   
		                 
           STOP RUN.
           
          END PROGRAM READSUPPLIER.
