       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. tut1.
AUTHOR. QUANYI WANG.
DATE-WRITTEN. October,25,2020.


ENVIRONMENT DIVISION.


DATA DIVISION.
FILE SECTION.

WORKING-STORAGE SECTION.
01 UserName PIC X(30).

PROCEDURE DIVISION.
DISPLAY "WHAT IS YOUR NAME? " WITH NO ADVANCING
ACCEPT UserName
DISPLAY "HELLO, " UserName


STOP RUN.
