       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. tut5.
AUTHOR. QUANYI WANG.
DATE-written. October,28,2020.


ENVIRONMENT DIVISION.
CONFIGURATION SECTION.



DATA DIVISION.
FILE SECTION.

WORKING-STORAGE SECTION.
01 ind pic 9(1) value 0.

PROCEDURE DIVISION.
perform outputdata with test after until ind >5


STOP RUN.
