       >>source format free
IDENTIFICATION DIVISION.
PROGRAM-ID. AREA-OF-CIRCLE.
DATA DIVISION.
WORKING-STORAGE SECTION.
*> 01 WS-CONSTANTS.
       01 WS-PI PIC 9V9999999 VALUE 3.1415926.
*> 01 WS-CIRCLE. comment out this lin, remember to change the leading number to 01
       01 WS-AREA PIC 999V999 VALUE ZEROS.
       01 WS-RADIUS PIC 9999V99 VALUE ZEROS.
       01 WS-CIRCUMFERENCE PIC 9999V99.
*> CANCEL THE LEADING ZEROS BY ZZ99.99.
       01 WS-DISPLAY-CIRCUMFERENCE PIC ZZ99.99.
       01 WS-DISPLAY-AREA PIC ZZ99.99.


PROCEDURE DIVISION.
DISPLAY "PLZ ENTER THE RADIUS:"
ACCEPT WS-RADIUS.
COMPUTE WS-CIRCUMFERENCE=2 * WS-PI * WS-RADIUS.
MOVE WS-CIRCUMFERENCE TO WS-DISPLAY-CIRCUMFERENCE.
DISPLAY "CIRCLE CIRCUMFERENCE IS: ", WS-DISPLAY-CIRCUMFERENCE.
COMPUTE WS-AREA=WS-PI*WS-RADIUS*WS-RADIUS.
MOVE WS-AREA TO WS-DISPLAY-AREA.
DISPLAY "THE AREA OF A CIRCLE IS: " WS-DISPLAY-AREA.

STOP RUN.


