       IDENTIFICATION DIVISION.
       PROGRAM-ID. CH4SOLUTION.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   SELECT EMPLOYEEFILE ASSIGN TO "EES.DAT"
        FILE STATUS IS FILE-CHECK-KEY
		ORGANIZATION IS LINE SEQUENTIAL.
          
	   SELECT NEWEMPFILE ASSIGN TO "EES.NEW"
 		ORGANIZATION IS LINE SEQUENTIAL.   
          
               
       DATA DIVISION.
       FILE SECTION.
	   FD EMPLOYEEFILE.
	   01 EMPDETAILS.
			88 ENDOFFILE VALUE HIGH-VALUES.
			02 EMPLOYEESSN 	 PIC 9(9).
			02 EMPLOYEENAME.
				03 LASTNAME	 PIC X(10).
				03 FIRSTNAME PIC X(10).
			02 STARTDATE.
				03 START-YEAR	PIC 9(4).
				03 START-MONTH	PIC 9(2).
				03 START-DAY	PIC 9(2).
			02 SALARY    	PIC 9(9).
			02 GENDER       PIC X.
			
       FD NEWEMPFILE.
	   01 NEWEMPRECORD.
	   	  88 ENDOFNEWFILE VALUE HIGH-VALUES.
	      02 NEW-EMPLOYEESSN 	 PIC 9(9).
		  02 NEW-EMPLOYEENAME  PIC X(20).
		  02 NEW-STARTDATE     PIC 9(8).
		  02 NEW-SALARY    	PIC 9(9).
		  02 NEW-GENDER       PIC X.
   
       WORKING-STORAGE SECTION.
	   01  WS-WORKING-STORAGE.
	       02  FILE-CHECK-KEY  PIC 99.
    
       01  HEADING-LINE.

            05 FILLER	        PIC X(11)  VALUE 'EMPLOYEE ID'.
            05 FILLER	        PIC X(4)   VALUE SPACES.
            05 FILLER	        PIC X(16)  VALUE 'EMPLOYEE NAME'.
            05 FILLER	        PIC X(9)   VALUE SPACES.
            05 FILLER	        PIC X(11)  VALUE 'SALARY'.
			05 FILLER           PIC X(71)  VALUE SPACES.

			
		01  DETAIL-LINE.
			05 DET-EMP-ID       PIC 9(9).
			05 FILLER           PIC X(6) VALUE SPACES.
			05 DET-EMPNAME      PIC X(20).
			05 FILLER           PIC XX.			   
			05 DET-SALARY       PIC $$$$,$$$,$$9.
			05 FILLER           PIC X(76).
			
      

       PROCEDURE DIVISION.
       0100-READ-EMPLOYEES.

		   OPEN INPUT EMPLOYEEFILE
           IF FILE-CHECK-KEY NOT = "00"
		      DISPLAY "NON-ZERO FILE STATUS RETURNED FROM OPEN ",
				 FILE-CHECK-KEY
		      GO TO 9000-END-PROGRAM
		   END-IF.
		   OPEN OUTPUT NEWEMPFILE.
		   READ EMPLOYEEFILE
			AT END SET ENDOFFILE TO TRUE
			END-READ.
			
		   PERFORM 0200-PROCESS-EMPLOYEES UNTIL ENDOFFILE.
		   
		   CLOSE EMPLOYEEFILE, NEWEMPFILE.
		   
           OPEN INPUT NEWEMPFILE.
		   READ NEWEMPFILE 
		    AT END SET ENDOFNEWFILE TO TRUE
		   END-READ.
		   DISPLAY HEADING-LINE.
		   PERFORM 0250-PRINT-NEW-EMPLOYEES UNTIL ENDOFNEWFILE.

		   PERFORM 9000-END-PROGRAM.
		   
	   0100-END.
	   
	   0200-PROCESS-EMPLOYEES.
	        MOVE EMPLOYEESSN TO NEW-EMPLOYEESSN.
	        MOVE EMPLOYEENAME TO NEW-EMPLOYEENAME.
			MOVE STARTDATE TO NEW-STARTDATE.
			COMPUTE NEW-SALARY = SALARY * 1.03.
			MOVE GENDER TO NEW-GENDER.
			WRITE NEWEMPRECORD.
			READ EMPLOYEEFILE 
			  AT END SET ENDOFFILE TO TRUE
			END-READ.
		  
	   0200-END. 
	   
	   0250-PRINT-NEW-EMPLOYEES.
	        MOVE NEW-EMPLOYEESSN TO DET-EMP-ID.
	        MOVE NEW-EMPLOYEENAME TO DET-EMPNAME.
			MOVE NEW-SALARY TO DET-SALARY.
			DISPLAY DETAIL-LINE.
			READ NEWEMPFILE
			  AT END SET ENDOFNEWFILE TO TRUE
			END-READ.
		  
	   0250-END.  
	   
	   9000-END-PROGRAM.	
           CLOSE NEWEMPFILE.	   
           STOP RUN.
           
          END PROGRAM CH4SOLUTION.
