       IDENTIFICATION DIVISION.
       PROGRAM-ID. UPDATEEMPLOYEES.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   SELECT EMPLOYEEFILE ASSIGN TO "EMPMASTER.DAT"
        FILE STATUS IS FILE-CHECK-KEY
		ORGANIZATION IS LINE SEQUENTIAL.
		
       SELECT TRANSFILE ASSIGN TO "EMPCHANGES.DAT"
        FILE STATUS IS FILE-CHECK-KEY2
        ORGANIZATION IS LINE SEQUENTIAL.		
       
       SELECT NEWEMPFILE ASSIGN TO "EMPFILE.NEW"
        ORGANIZATION IS LINE SEQUENTIAL.
              
       DATA DIVISION.
       FILE SECTION.
	   FD EMPLOYEEFILE.
	   01 EMPDETAILS.
			88 ENDOFFILE VALUE HIGH-VALUES.
			02 EMPID  	     PIC 9(7).
            02 DETAILS       PIC X(38).


       FD TRANSFILE.			
	   01 EMPTRANS.
			88 ENDOFFILE2 VALUE HIGH-VALUES.
			02 NEWEMPID  	 PIC 9(7).
			02 NEWDETAILS    PIC X(38).
			02 TRANSCODE     PIC X.
		
       FD NEWEMPFILE.			
	   01 NEWEMPRECORD       PIC X(45).
					
   
       WORKING-STORAGE SECTION.
       01  WS-WORKING-STORAGE.
           05 FILLER      PIC X(27) VALUE 
		      'WORKING STORAGE STARTS HERE'.
     
       01  WS-DATE.
           05  WS-YEAR PIC 99.
           05  WS-MONTH PIC 99.
           05  WS-DAY   PIC 99.
		   
	   01  WS-WORK-AREAS.
	       05  FILE-CHECK-KEY   PIC X(2).
		   05  FILE-CHECK-KEY2  PIC X(2).

       01  HEADING-LINE.

            05 FILLER	        PIC X(22)  VALUE 
			   'DUPLICATE ERROR REPORT'.
			05 FILLER           PIC X(110)  VALUE SPACES.

			
		01  DETAIL-LINE.
			05 DET-EMP-ID       PIC 9(7).
			05 DET-DETAILS      PIC X(38).


       PROCEDURE DIVISION.
       0100-READ-EMPLOYEES.

		   OPEN INPUT EMPLOYEEFILE
           IF FILE-CHECK-KEY NOT = "00"
		      DISPLAY "ERR: OPEN FILE ERROR EMPFILE ",
				 FILE-CHECK-KEY
		      GO TO 9000-END-PROGRAM
		   END-IF.
		   OPEN INPUT TRANSFILE
		   IF FILE-CHECK-KEY2 NOT = "00"
		      DISPLAY "ERR: OPEN FILE ERROR TRANSFILE ",
			     FILE-CHECK-KEY2
		   END-IF.	 

			 
		   OPEN OUTPUT NEWEMPFILE.
		   
		   READ EMPLOYEEFILE
			AT END SET ENDOFFILE TO TRUE
			END-READ.
			
		   READ TRANSFILE 
		    AT END SET ENDOFFILE2 TO TRUE
			END-READ.
			
		   PERFORM 0200-PROCESS-EMPLOYEES UNTIL 
		      (ENDOFFILE) AND (ENDOFFILE2).
		   		   
		   PERFORM 9000-END-PROGRAM.
		   
	   0100-END.
	   
	   0200-PROCESS-EMPLOYEES.
	        EVALUATE TRUE
			  WHEN(EMPID < NEWEMPID)
			    WRITE NEWEMPRECORD FROM EMPDETAILS
				  READ EMPLOYEEFILE 
				    AT END SET ENDOFFILE TO TRUE
				  END-READ
				  
			  WHEN (EMPID > NEWEMPID)
			    WRITE NEWEMPRECORD FROM EMPTRANS 
				  READ TRANSFILE
				    AT END SET ENDOFFILE2 TO TRUE
			      END-READ 
				 
				  
			  WHEN (EMPID = NEWEMPID AND TRANSCODE = 'D')
                  READ TRANSFILE
                      AT END SET ENDOFFILE2 TO TRUE
                  END-READ	
                  READ EMPLOYEEFILE 
				    AT END SET ENDOFFILE TO TRUE
				  END-READ
				  
              WHEN (EMPID = NEWEMPID AND TRANSCODE = 'C')
			      MOVE EMPID TO DET-EMP-ID
				  MOVE DETAILS TO DET-DETAILS
			      WRITE NEWEMPRECORD FROM DETAIL-LINE
                  READ TRANSFILE
                      AT END SET ENDOFFILE2 TO TRUE
                  END-READ
                  READ EMPLOYEEFILE 
				    AT END SET ENDOFFILE TO TRUE
				  END-READ				  
		    END-EVALUATE.
		  
	   0200-END. 
	   
	   
	   9000-END-PROGRAM.
           CLOSE EMPLOYEEFILE.	
		   CLOSE TRANSFILE.
           CLOSE NEWEMPFILE.		   
      
           STOP RUN.
           
          END PROGRAM UPDATEEMPLOYEES.
